INFP=INFP\uB294 \uC790\uC2E0\uC758 \uD575\uC2EC \uAC00\uCE58\uC640 \uC2E0\uB150\uC5D0 \uB530\uB77C \uC0C1\uC0C1\uB825\uC774 \uD48D\uBD80\uD55C \uC774\uC0C1\uC8FC\uC758\uC790\uC785\uB2C8\uB2E4. \uD790\uB7EC\uC5D0\uAC8C\uB294 \uAC00\uB2A5\uC131\uC774 \uAC00\uC7A5 \uC911\uC694\uD569\uB2C8\uB2E4. \uC21C\uAC04\uC758 \uD604\uC2E4\uC740 \uADF8\uC800 \uC9C0\uB098\uAC00\uB294 \uAD00\uC2EC\uC0AC\uC77C \uBFD0\uC785\uB2C8\uB2E4. \uADF8\uB4E4\uC740 \uB354 \uB098\uC740 \uBBF8\uB798\uC758 \uAC00\uB2A5\uC131\uC744 \uBCF4\uACE0, \uC790\uC2E0\uB9CC\uC758 \uAC10\uAC01\uC73C\uB85C \uC9C4\uC2E4\uACFC \uC758\uBBF8\uB97C \uCD94\uAD6C\uD569\uB2C8\uB2E4.
INTJ=INTJ\uB294 \uBD84\uC11D\uC801 \uBB38\uC81C \uD574\uACB0\uC0AC\uC774\uBA70 \uD601\uC2E0\uC801\uC778 \uC544\uC774\uB514\uC5B4\uB85C \uC2DC\uC2A4\uD15C\uACFC \uD504\uB85C\uC138\uC2A4\uB97C \uAC1C\uC120\uD558\uACE0\uC790 \uD569\uB2C8\uB2E4. \uADF8\uB4E4\uC740 \uC9C1\uC7A5\uC5D0\uC11C\uB4E0, \uC9D1\uC5D0\uC11C\uB4E0, \uC790\uC2E0\uC5D0\uAC8C\uC11C\uB4E0 \uAC1C\uC120\uC758 \uAC00\uB2A5\uC131\uC744 \uBCF4\uB294 \uC7AC\uB2A5\uC774 \uC788\uC2B5\uB2C8\uB2E4.
INFJ=INFJ\uB294 \uAC1C\uC778\uC758 \uC815\uC9C1\uC131\uC5D0 \uB300\uD55C \uAC15\uD55C \uAC10\uAC01\uACFC \uB2E4\uB978 \uC0AC\uB78C\uB4E4\uC774 \uC790\uC2E0\uC758 \uC7A0\uC7AC\uB825\uC744 \uC2E4\uD604\uD558\uB3C4\uB85D \uB3D5\uB294 \uCD94\uC9C4\uB825\uC744 \uAC00\uC9C4 \uCC3D\uC758\uC801\uC778 \uC591\uC721\uC790\uC785\uB2C8\uB2E4. \uCC3D\uC758\uC801\uC774\uACE0 \uD5CC\uC2E0\uC801\uC774\uBA70 \uAC1C\uC778\uC801\uC778 \uBB38\uC81C\uC5D0 \uB300\uD55C \uB3C5\uCC3D\uC801\uC778 \uD574\uACB0\uCC45\uC73C\uB85C \uB2E4\uB978 \uC0AC\uB78C\uC744 \uB3D5\uB294 \uC7AC\uB2A5\uC774 \uC788\uC2B5\uB2C8\uB2E4.
INTP=INTP\uB294 \uB17C\uB9AC\uC801 \uBD84\uC11D, \uC2DC\uC2A4\uD15C \uBC0F \uB514\uC790\uC778\uC5D0 \uB9E4\uB8CC\uB41C \uCCA0\uD559\uC801 \uD601\uC2E0\uAC00\uC785\uB2C8\uB2E4. \uADF8\uB4E4\uC740 \uC774\uB860\uC5D0 \uBAB0\uB450\uD558\uACE0 \uADF8\uB4E4\uC774 \uBCF4\uB294 \uBAA8\uB4E0 \uAC83 \uB4A4\uC5D0 \uC788\uB294 \uBCF4\uD3B8\uC801\uC778 \uBC95\uCE59\uC744 \uCC3E\uC2B5\uB2C8\uB2E4. \uADF8\uB4E4\uC740 \uBAA8\uB4E0 \uBCF5\uC7A1\uC131 \uC18D\uC5D0\uC11C \uC0B6\uC758 \uD1B5\uC77C\uB41C \uC8FC\uC81C\uB97C \uC774\uD574\uD558\uAE30\uB97C \uC6D0\uD569\uB2C8\uB2E4.
ENFP=ENFP\uB294 \uAC00\uB2A5\uC131\uC5D0 \uCD08\uC810\uC744 \uB9DE\uCD94\uACE0 \uC0C8\uB85C\uC6B4 \uC544\uC774\uB514\uC5B4, \uC0AC\uB78C \uBC0F \uD65C\uB3D9\uC5D0 \uB300\uD55C \uC804\uC5FC\uC131 \uC788\uB294 \uC5F4\uC815\uC744 \uAC00\uC9C4 \uC0AC\uB78C \uC911\uC2EC\uC758 \uCC3D\uC870\uC790\uC785\uB2C8\uB2E4. \uD65C\uAE30\uCC28\uACE0 \uB530\uB73B\uD558\uBA70 \uC5F4\uC815\uC801\uC778 ENFP\uB294 \uB2E4\uB978 \uC0AC\uB78C\uB4E4\uC774 \uC790\uC2E0\uC758 \uCC3D\uC758\uC801 \uC7A0\uC7AC\uB825\uC744 \uD0D0\uAD6C\uD558\uB3C4\uB85D \uB3D5\uB294 \uAC83\uC744 \uC88B\uC544\uD569\uB2C8\uB2E4.
ENTJ=ENTJ\uB294 \uBCC0\uD654\uB97C \uC870\uC9C1\uD558\uB824\uB294 \uB3D9\uAE30\uAC00 \uC788\uB294 \uC804\uB7B5\uC801 \uB9AC\uB354\uC785\uB2C8\uB2E4. \uADF8\uB4E4\uC740 \uBE44\uD6A8\uC728\uC131\uC744 \uBE60\uB974\uAC8C \uD30C\uC545\uD558\uACE0 \uC0C8\uB85C\uC6B4 \uC194\uB8E8\uC158\uC744 \uAC1C\uB150\uD654\uD558\uBA70 \uBE44\uC804\uC744 \uB2EC\uC131\uD558\uAE30 \uC704\uD55C \uC7A5\uAE30 \uACC4\uD68D \uAC1C\uBC1C\uC744 \uC990\uAE41\uB2C8\uB2E4. \uADF8\uB4E4\uC740 \uB17C\uB9AC\uC801 \uCD94\uB860\uC5D0 \uD0C1\uC6D4\uD558\uBA70 \uC77C\uBC18\uC801\uC73C\uB85C \uBA85\uB8CC\uD558\uACE0 \uC7AC\uCE58\uAC00 \uC788\uC2B5\uB2C8\uB2E4.
ENFJ=ENFJ\uB294 \uC778\uB958\uB97C \uC704\uD55C \uCD5C\uC120\uC758 \uBE44\uC804\uC744 \uAD6C\uD604\uD558\uAE30 \uC704\uD574 \uB178\uB825\uD558\uB294 \uC774\uC0C1\uC8FC\uC758\uC801 \uC870\uC9C1\uAC00\uC785\uB2C8\uB2E4. \uD0C0\uC778\uC758 \uAC00\uB2A5\uC131\uC744 \uBCF4\uB294 \uB2A5\uB825\uACFC \uC790\uC2E0\uC758 \uC0DD\uAC01\uC744 \uC124\uB4DD\uD558\uB294 \uCE74\uB9AC\uC2A4\uB9C8 \uB54C\uBB38\uC5D0 \uC778\uAC04 \uC131\uC7A5\uC758 \uCD09\uB9E4 \uC5ED\uD560\uC744 \uD558\uB294 \uACBD\uC6B0\uAC00 \uB9CE\uB2E4.
ISFJ=ISFJ\uB294 \uADFC\uBA74\uD55C \uAD00\uB9AC\uC778\uC774\uBA70 \uC804\uD1B5\uACFC \uC870\uC9C1\uC5D0 \uCDA9\uC2E4\uD569\uB2C8\uB2E4. \uADF8\uB4E4\uC740 \uC2E4\uC6A9\uC801\uC774\uACE0 \uB3D9\uC815\uC2EC\uC774 \uB9CE\uC73C\uBA70 \uBC30\uB824\uC2EC\uC774 \uB9CE\uC73C\uBA70 \uB2E4\uB978 \uC0AC\uB78C\uC744 \uBD80\uC591\uD558\uACE0 \uC0DD\uBA85\uC758 \uC704\uD5D8\uC73C\uB85C\uBD80\uD130 \uBCF4\uD638\uD558\uB824\uB294 \uB3D9\uAE30\uAC00 \uC788\uC2B5\uB2C8\uB2E4.
ISFP=ISFP\uB294 \uD604\uC7AC\uB97C \uC0B4\uBA70 \uBA85\uB791\uD558\uACE0 \uC808\uC81C\uB41C \uC5F4\uC815\uC73C\uB85C \uC8FC\uBCC0 \uD658\uACBD\uC744 \uC990\uAE30\uB294 \uC628\uD654\uD55C \uAD00\uB9AC\uC778\uC785\uB2C8\uB2E4. \uADF8\uB4E4\uC740 \uC720\uC5F0\uD558\uACE0 \uC790\uBC1C\uC801\uC774\uBA70 \uC0B6\uC774 \uC81C\uACF5\uD558\uB294 \uAC83\uC744 \uC990\uAE30\uAE30 \uC704\uD574 \uD750\uB984\uC744 \uB530\uB77C\uAC00\uB294 \uAC83\uC744 \uC88B\uC544\uD569\uB2C8\uB2E4.
ISTJ=ISTJ\uB294 \uC2DC\uC2A4\uD15C\uACFC \uAE30\uAD00 \uB0B4\uC5D0\uC11C \uC9C8\uC11C\uB97C \uB9CC\uB4E4\uACE0 \uC9D1\uD589\uD558\uB294 \uCC45\uC784\uAC10 \uC788\uB294 \uC870\uC9C1\uC790\uC785\uB2C8\uB2E4. \uADF8\uB4E4\uC740 \uB0B4\uBD80\uC640 \uC678\uBD80\uAC00 \uB2E8\uC815\uD558\uACE0 \uC815\uB3C8\uB418\uC5B4 \uC788\uC73C\uBA70 \uADF8\uB4E4\uC774 \uD558\uB294 \uBAA8\uB4E0 \uC77C\uC5D0 \uC808\uCC28\uAC00 \uC788\uB294 \uACBD\uD5A5\uC774 \uC788\uC2B5\uB2C8\uB2E4.
ISTP=ISTP\uB294 \uC5ED\uD559\uC5D0 \uB300\uD55C \uC774\uD574\uC640 \uBB38\uC81C \uD574\uACB0\uC5D0 \uB300\uD55C \uAD00\uC2EC\uC744 \uAC00\uC9C4 \uAD00\uCC30\uB825 \uC788\uB294 \uC7A5\uC778\uC785\uB2C8\uB2E4. \uADF8\uB4E4\uC740 \uB2F9\uBA74\uD55C \uBB38\uC81C\uC5D0 \uB300\uD55C \uC2E4\uC6A9\uC801\uC778 \uD574\uACB0\uCC45\uC744 \uCC3E\uAE30 \uC704\uD574 \uC720\uC5F0\uD55C \uB17C\uB9AC\uB85C \uD658\uACBD\uC5D0 \uC811\uADFC\uD569\uB2C8\uB2E4.
ESFJ=ESFJ\uB294 \uC131\uC2E4\uD55C \uC870\uB825\uC790\uC774\uBA70 \uB2E4\uB978 \uC0AC\uB78C\uC758 \uC694\uAD6C\uC5D0 \uBBFC\uAC10\uD558\uACE0 \uC790\uC2E0\uC758 \uCC45\uC784\uC5D0 \uC5F4\uC815\uC801\uC73C\uB85C \uD5CC\uC2E0\uD569\uB2C8\uB2E4. \uADF8\uB4E4\uC740 \uC790\uC2E0\uC758 \uAC10\uC815\uC801 \uD658\uACBD\uC5D0 \uB9E4\uC6B0 \uC798 \uC801\uC751\uD558\uACE0 \uD0C0\uC778\uC758 \uAC10\uC815\uACFC \uD0C0\uC778\uC774 \uC790\uC2E0\uC5D0 \uB300\uD574 \uAC16\uB294 \uC778\uC2DD \uBAA8\uB450\uC5D0 \uC8FC\uC758\uB97C \uAE30\uC6B8\uC785\uB2C8\uB2E4.
ESFP=ESFP\uB294 \uC8FC\uBCC0 \uC0AC\uB78C\uB4E4\uC744 \uB9E4\uB8CC\uC2DC\uD0A4\uACE0 \uCC38\uC5EC\uC2DC\uD0A4\uB294 \uBC1C\uB784\uD55C \uC5D4\uD130\uD14C\uC774\uB108\uC785\uB2C8\uB2E4. \uADF8\uB4E4\uC740 \uC790\uBC1C\uC801\uC774\uACE0 \uD65C\uAE30\uCC28\uACE0 \uC7AC\uBBF8\uB97C \uC88B\uC544\uD558\uBA70 \uC74C\uC2DD, \uC637, \uC790\uC5F0, \uB3D9\uBB3C, \uD2B9\uD788 \uC0AC\uB78C\uACFC \uAC19\uC740 \uC8FC\uBCC0 \uC0AC\uBB3C\uC744 \uC990\uAE41\uB2C8\uB2E4.
ESTJ=ESTJ\uB294 \uADFC\uBA74\uD55C \uC804\uD1B5\uC8FC\uC758\uC790\uC774\uBA70 \uD504\uB85C\uC81D\uD2B8\uC640 \uC0AC\uB78C\uC744 \uC870\uC9C1\uD558\uB294 \uB370 \uC5F4\uC2EC\uC785\uB2C8\uB2E4. \uC9C8\uC11C \uC815\uC5F0\uD558\uACE0 \uADDC\uCE59\uC744 \uC900\uC218\uD558\uBA70 \uC131\uC2E4\uD55C ESTJ\uB294 \uC77C\uC744 \uB05D\uB0B4\uB294 \uAC83\uC744 \uC88B\uC544\uD558\uACE0 \uCCB4\uACC4\uC801\uC774\uACE0 \uCCB4\uACC4\uC801\uC73C\uB85C \uD504\uB85C\uC81D\uD2B8\uB97C \uC218\uD589\uD558\uB294 \uACBD\uD5A5\uC774 \uC788\uC2B5\uB2C8\uB2E4.
ESTP=ESTP\uB294 \uBB38\uC790 \uADF8\uB300\uB85C\uB4E0 \uC740\uC720\uC801\uC73C\uB85C\uB4E0 \uBD88\uC744 \uB04C \uB54C \uCD5C\uC120\uC744 \uB2E4\uD558\uB294 \uD65C\uAE30\uCC2C \uC2A4\uB9B4 \uCD94\uAD6C\uC790\uC785\uB2C8\uB2E4. \uADF8\uB4E4\uC740 \uB2E4\uB978 \uC0AC\uB78C \uBC0F \uC8FC\uBCC0 \uC138\uACC4\uC640\uC758 \uC0C1\uD638\uC791\uC6A9\uC5D0 \uC5ED\uB3D9\uC801\uC778 \uC5D0\uB108\uC9C0\uB97C \uAC00\uC838\uB2E4\uC90D\uB2C8\uB2E4.